Revit 2027 API
MEPModel.GetElectricalSystems Method
 Retrieves the electrical systems that are currently created using this MEPModel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElectricalSystem> GetElectricalSystems()
Public Function GetElectricalSystems As ISet(Of ElectricalSystem)
public:
ISet<ElectricalSystem^>^ GetElectricalSystems()
member GetElectricalSystems : unit -> ISet<ElectricalSystem>
Return Value
ISet<ElectricalSystem>
Remarks
 This property returns a set of Electrical Systems. If there are no electrical systems created for this model, this property will be an empty set. This method supersedes an older ElectricalSystems property which has been deprecated.
See Also
Reference
MEPModel Class
Autodesk.Revit.DB Namespace